sakumisu/sdk-bsp-stm32h7r-realthread-artpi2/libraries/bsp_components/hspi/stm32h7rsxx_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS256XX_Read_DMA(&hhspi_ram[Instance], pData, ReadAddr, Size,
                          (uint32_t)APS256XX_READ_LATENCY((uint32_t)(Hspi_Ram_Ctx[Instance].ReadLatencyCode),
                                                          (uint32_t)(Hspi_Ram_Ctx[Instance].LatencyType)),
                          (uint32_t)(Hspi_Ram_Ctx[Instance].IOMode),
                          (uint32_t)(Hspi_Ram_Ctx[Instance].BurstType)) != (int32_t)APS256XX_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes an amount of data to the 16-bits Octal RAM memory.
  * @param  Instance  HSPI instance
  * @param  pData     Pointer to data to be written
  * @param  WriteAddr Write start address
  * @param  Size      Size of data to write
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_Write(uint32_t Instance, uint8_t *pData, uint32_t WriteAddr, uint32_t Size)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }

  else
  {
    if (APS256XX_Write(&hhspi_ram[Instance], pData, WriteAddr, Size,
                       (uint32_t)APS256XX_WRITE_LATENCY((uint32_t)(Hspi_Ram_Ctx[Instance].WriteLatencyCode)),
                       (uint32_t)(Hspi_Ram_Ctx[Instance].IOMode),
                       (uint32_t)(Hspi_Ram_Ctx[Instance].BurstType)) != (int32_t)APS256XX_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes an amount of data to the 16-bits Octal RAM memory in DMA mode.
  * @param  Instance  HSPI instance
  * @param  pData     Pointer to data to be written
  * @param  WriteAddr Write start address
  * @param  Size      Size of data to write
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_Write_DMA(uint32_t Instance, uint8_t *pData, uint32_t WriteAddr, uint32_t Size)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS256XX_Write_DMA(&hhspi_ram[Instance], pData, WriteAddr, Size,
                           (uint32_t)APS256XX_WRITE_LATENCY((uint32_t)(Hspi_Ram_Ctx[Instance].WriteLatencyCode)),
                           (uint32_t)(Hspi_Ram_Ctx[Instance].IOMode),
                           (uint32_t)(Hspi_Ram_Ctx[Instance].BurstType)) != (int32_t)APS256XX_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Configure the HSPI in memory-mapped mode
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_EnableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS256XX_EnableMemoryMappedMode(&hhspi_ram[Instance], (uint32_t)APS256XX_READ_LATENCY((uint32_t)\
                                        ((uint32_t)(Hspi_Ram_Ctx[Instance].ReadLatencyCode)),
                                        (uint32_t)(Hspi_Ram_Ctx[Instance].LatencyType)),
                                        APS256XX_WRITE_LATENCY((uint32_t)\
                                                               (Hspi_Ram_Ctx[Instance].WriteLatencyCode)),
                                        (uint32_t)(Hspi_Ram_Ctx[Instance].IOMode),
                                        (uint32_t)(Hspi_Ram_Ctx[Instance].BurstType)) != (int32_t)APS256XX_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Update HSPI context if all operations are well done */
    {
      Hspi_Ram_Ctx[Instance].IsInitialized = HSPI_ACCESS_MMP;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Exit form memory-mapped mode
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_DisableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  uint32_t tickstart = HAL_GetTick();

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Hspi_Ram_Ctx[Instance].IsInitialized != HSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_HSPI_MMP_UNLOCK_FAILURE;
    }
    /* Abort MMP back to indirect mode */
    else if (HAL_XSPI_Abort(&hhspi_ram[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    /* Update HSPI 16-bits Octal RAM context if all operations are well done */
    else
    {
      /* Wait until flag is in expected state */
      while ((HAL_XSPI_GET_FLAG(&hhspi_ram[Instance], HAL_XSPI_FLAG_BUSY)) != RESET)
      {
        /* Check for the Timeout */
        if (((HAL_GetTick() - tickstart) > hhspi_ram[Instance].Timeout) || (hhspi_ram[Instance].Timeout == 0U))
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
          break;
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        /* Configure CR register with functional mode as indirect mode*/
        MODIFY_REG(hhspi_ram[Instance].Instance->CR, (XSPI_CR_FMODE), 0U);
        Hspi_Ram_Ctx[Instance].IsInitialized = HSPI_ACCESS_INDIRECT;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Set 16-bits Octal RAM to desired configuration. And this instance becomes current instance.
  *         If current instance running at MMP mode then this function doesn't work.
  *         Indirect -> Indirect
  * @param  Instance    HSPI instance
  * @param  Cfg         pointer to the RAM config
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_Config16BitsOctalRAM(uint32_t Instance, BSP_HSPI_RAM_Cfg_t *Cfg)
{
  int32_t ret = BSP_ERROR_NONE;
  uint8_t reg[2];

