sakumisu/sdk-bsp-stm32h7r-realthread-artpi2/libraries/bsp_components/hspi/stm32h7rsxx_hspi.c
  /* Check if the instance is supported */
  if ((Instance >= HSPI_RAM_INSTANCES_NUMBER)
      || (Cfg->BurstLength == APS256XX_BURST_2_KBYTES))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if MMP mode locked ***********************************************/
    if (Hspi_Ram_Ctx[Instance].IsInitialized == HSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_HSPI_MMP_LOCK_FAILURE;
    }
    else
    {
      if ((Hspi_Ram_Ctx[Instance].IsInitialized  == HSPI_ACCESS_NONE) ||
          (Hspi_Ram_Ctx[Instance].LatencyType     != Cfg->LatencyType)  ||
          (Hspi_Ram_Ctx[Instance].ReadLatencyCode != Cfg->ReadLatencyCode))
      {
        /* Reading the configuration of Mode Register 0 ***********************/
        if (APS256XX_ReadReg(&hhspi_ram[Instance], APS256XX_MR0_ADDRESS, reg,
                             (uint32_t)APS256XX_READ_REG_LATENCY((uint32_t)(Hspi_Ram_Ctx[Instance].ReadLatencyCode)))\
            != (int32_t)APS256XX_OK)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          /* Configure the 16-bits Octal RAM memory ***************************/
          MODIFY_REG(reg[0], ((uint8_t)APS256XX_MR0_LATENCY_TYPE | (uint8_t)APS256XX_MR0_READ_LATENCY_CODE |
                              (uint8_t)APS256XX_MR0_DRIVE_STRENGTH),
                     ((uint8_t)(Cfg->LatencyType) | (uint8_t)(Cfg->ReadLatencyCode) | (uint8_t)CONF_HSPI_DS));

          if (APS256XX_WriteReg(&hhspi_ram[Instance], APS256XX_MR0_ADDRESS, reg[0]) != APS256XX_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          /* Configure the peripheral *****************************************/
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        if ((Hspi_Ram_Ctx[Instance].IsInitialized   == HSPI_ACCESS_NONE) ||
            (Hspi_Ram_Ctx[Instance].WriteLatencyCode != Cfg->WriteLatencyCode))
        {
          /* Reading the configuration of Mode Register 4 ***********************/
          if (APS256XX_ReadReg(&hhspi_ram[Instance], APS256XX_MR4_ADDRESS, reg,
                               (uint32_t)APS256XX_READ_REG_LATENCY((uint32_t)(Hspi_Ram_Ctx[Instance].ReadLatencyCode)))\
              != (int32_t)APS256XX_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else
          {
            /* Configure the 16-bits Octal RAM memory ***************************/
            MODIFY_REG(reg[0], (uint8_t)(APS256XX_MR4_WRITE_LATENCY_CODE | APS256XX_MR4_RF_RATE | APS256XX_MR4_PASR),
                       ((uint8_t)Cfg->WriteLatencyCode | CONF_HSPI_RF | CONF_HSPI_PASR));

            if (APS256XX_WriteReg(&hhspi_ram[Instance], APS256XX_MR4_ADDRESS, reg[0]) != APS256XX_OK)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
          }
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        if ((Hspi_Ram_Ctx[Instance].IsInitialized == HSPI_ACCESS_NONE)  ||
            (Hspi_Ram_Ctx[Instance].BurstType      != Cfg->BurstType)   ||
            (Hspi_Ram_Ctx[Instance].BurstLength    != Cfg->BurstLength) ||
            (Hspi_Ram_Ctx[Instance].IOMode         != Cfg->IOMode))
        {
          /* Reading the configuration of Mode Register 8 ***********************/
          if (APS256XX_ReadReg(&hhspi_ram[Instance], APS256XX_MR8_ADDRESS, reg,
                               (uint32_t)APS256XX_READ_REG_LATENCY((uint32_t)\
                                                                   (Hspi_Ram_Ctx[Instance].ReadLatencyCode)))\
              != (int32_t)APS256XX_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else
          {
            /* Configure the 16-bits Octal RAM memory ***************************/
            MODIFY_REG(reg[0], ((uint8_t)APS256XX_MR8_X8_X16 | (uint8_t)APS256XX_MR8_BL),
                       ((uint8_t)(Cfg->IOMode) | (uint8_t)(Cfg->BurstLength)));

            if (APS256XX_WriteReg(&hhspi_ram[Instance], APS256XX_MR8_ADDRESS, reg[0]) != APS256XX_OK)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
              /* Configure the peripheral *****************************************/
              if (Cfg->BurstType == BSP_HSPI_RAM_HYBRID_BURST)
              {
                switch (Cfg->BurstLength)
                {
                  case APS256XX_MR8_BL_16_BYTES :
                    hhspi_ram[Instance].Init.WrapSize = HAL_XSPI_WRAP_16_BYTES;
                    break;
                  case APS256XX_MR8_BL_32_BYTES :
                    hhspi_ram[Instance].Init.WrapSize = HAL_XSPI_WRAP_32_BYTES;
                    break;
                  case APS256XX_MR8_BL_64_BYTES :
                    hhspi_ram[Instance].Init.WrapSize = HAL_XSPI_WRAP_64_BYTES;
                    break;
                  default :
                    break;
                }
              }
              else
              {
                hhspi_ram[Instance].Init.WrapSize = HAL_XSPI_WRAP_NOT_SUPPORTED;
              }

              if (Cfg->IOMode == BSP_HSPI_RAM_IO_X16_MODE)
              {
                hhspi_ram[Instance].Init.MemoryType = HAL_XSPI_MEMTYPE_APMEM_16BITS;
              }
              else
              {
                hhspi_ram[Instance].Init.MemoryType = HAL_XSPI_MEMTYPE_APMEM;
              }

              if (HAL_XSPI_DeInit(&hhspi_ram[Instance]) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }

              if (HAL_XSPI_Init(&hhspi_ram[Instance]) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
        }
      }

      /* Update HSPI context if all operations are well done */
      if (ret == BSP_ERROR_NONE)
      {
        /* Update current status parameter *****************************************/
        Hspi_Ram_Ctx[Instance].IsInitialized    = HSPI_ACCESS_INDIRECT;
        Hspi_Ram_Ctx[Instance].LatencyType      = Cfg->LatencyType;
        Hspi_Ram_Ctx[Instance].ReadLatencyCode  = Cfg->ReadLatencyCode;
        Hspi_Ram_Ctx[Instance].WriteLatencyCode = Cfg->WriteLatencyCode;
        Hspi_Ram_Ctx[Instance].BurstType        = Cfg->BurstType;
        Hspi_Ram_Ctx[Instance].BurstLength      = Cfg->BurstLength;
        Hspi_Ram_Ctx[Instance].IOMode           = Cfg->IOMode;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function enter the 16-bits Octal RAM memory in deep power down mode.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_EnterDeepPowerDown(uint32_t Instance)
{
  int32_t ret;

