sakumisu/sdk-bsp-stm32h7r-realthread-artpi2/libraries/bsp_components/hspi/stm32h7rsxx_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (APS256XX_EnterPowerDown(&hhspi_ram[Instance]) != APS256XX_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* ---         Memory enter deep power down as soon nCS goes high        --- */
    /* --- At least 500us should be respected before leaving deep power down --- */

    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function leave the 16-bits Octal RAM memory from deep power down mode.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_LeaveDeepPowerDown(uint32_t Instance)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (APS256XX_LeavePowerDown(&hhspi_ram[Instance]) != APS256XX_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* --- A dummy command is sent to the memory, as the nCS should be low for at least 60 ns  --- */
    /* ---                  Memory takes 150us max to leave deep power down                    --- */

    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Handles HSPI 16-bits Octal RAM DMA transfer interrupt request.
  * @param  Instance HSPI instance
  * @retval None
  */
void BSP_HSPI_RAM_DMA_IRQHandler(uint32_t Instance)
{
  HAL_DMA_IRQHandler(hhspi_ram[Instance].hdmatx);
  HAL_DMA_IRQHandler(hhspi_ram[Instance].hdmarx);
}

/**
  * @brief  Handles HSPI 16-bits Octal RAM interrupt request.
  * @param  Instance HSPI instance
  * @retval None
  */
void BSP_HSPI_RAM_IRQHandler(uint32_t Instance)
{
  HAL_XSPI_IRQHandler(&hhspi_ram[Instance]);
}
/**
  * @}
  */

/** @addtogroup STM32U5x9J_DISCOVERY_HSPI_RAM_Private_Functions HSPI RAM Private Functions
  * @{
  */

/**
  * @brief  Initializes the HSPI MSP.
  * @param  hhspi HSPI handle
  * @retval None
  */
static void HSPI_RAM_MspInit(XSPI_HandleTypeDef *hhspi)
{


    uint32_t xspi1_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_XSPI1);
  /* USER CODE END XSPI1_Init 0 */

  XSPIM_CfgTypeDef sXspiManagerCfg = {0};

  /* USER CODE BEGIN XSPI1_Init 1 */

  /* USER CODE END XSPI1_Init 1 */
  /* XSPI1 parameter configuration*/
  hhspi->Instance = XSPI1;
  hhspi->Init.FifoThresholdByte = 2U;
  hhspi->Init.MemoryMode = HAL_XSPI_SINGLE_MEM;
  hhspi->Init.MemoryType = HAL_XSPI_MEMTYPE_APMEM_16BITS;
  hhspi->Init.MemorySize = HAL_XSPI_SIZE_32GB;
  hhspi->Init.ChipSelectHighTimeCycle = 1U;
  hhspi->Init.FreeRunningClock = HAL_XSPI_FREERUNCLK_DISABLE;
  hhspi->Init.ClockMode = HAL_XSPI_CLOCK_MODE_0;
  hhspi->Init.WrapSize = HAL_XSPI_WRAP_NOT_SUPPORTED;
  hhspi->Init.ClockPrescaler = 0;
  hhspi->Init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;
  hhspi->Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_ENABLE;
  hhspi->Init.ChipSelectBoundary = HAL_XSPI_BONDARYOF_8KB;
  hhspi->Init.MaxTran = 0;
  hhspi->Init.Refresh = ((2U * (xspi1_clk / (hhspi->Init.ClockPrescaler + 1U))) / 1000000U) - 4U;;
  hhspi->Init.MemorySelect = HAL_XSPI_CSSEL_NCS1;
  if (HAL_XSPI_Init(hhspi) != HAL_OK)
  {
    Error_Handler();
  }
  sXspiManagerCfg.nCSOverride = HAL_XSPI_CSSEL_OVR_NCS1;
  sXspiManagerCfg.IOPort = HAL_XSPIM_IOPORT_1;
  if (HAL_XSPIM_Config(hhspi, &sXspiManagerCfg, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }


  // static DMA_HandleTypeDef hdmatx, hdmarx;
  // GPIO_InitTypeDef GPIO_InitStruct;

  // __HAL_RCC_PWR_CLK_ENABLE();
  // SET_BIT(PWR->SVMCR, PWR_SVMCR_IO2SV);

  // /* Enable the HSPI memory interface, DMA and GPIO clocks */
  // HSPI_CLK_ENABLE();
  // HSPI_RAM_DMAx_CLK_ENABLE();
  // HSPI_CLK_GPIO_CLK_ENABLE();
  // HSPI_DQS0_GPIO_CLK_ENABLE();
  // HSPI_DQS1_GPIO_CLK_ENABLE();
  // HSPI_CS_GPIO_CLK_ENABLE();
  // HSPI_D0_GPIO_CLK_ENABLE();
  // HSPI_D1_GPIO_CLK_ENABLE();
  // HSPI_D2_GPIO_CLK_ENABLE();
  // HSPI_D3_GPIO_CLK_ENABLE();
  // HSPI_D4_GPIO_CLK_ENABLE();
  // HSPI_D5_GPIO_CLK_ENABLE();
  // HSPI_D6_GPIO_CLK_ENABLE();
  // HSPI_D7_GPIO_CLK_ENABLE();
  // HSPI_D8_GPIO_CLK_ENABLE();
  // HSPI_D9_GPIO_CLK_ENABLE();
  // HSPI_D10_GPIO_CLK_ENABLE();
  // HSPI_D11_GPIO_CLK_ENABLE();
  // HSPI_D12_GPIO_CLK_ENABLE();
  // HSPI_D13_GPIO_CLK_ENABLE();
  // HSPI_D14_GPIO_CLK_ENABLE();
  // HSPI_D15_GPIO_CLK_ENABLE();

  // /*  Activate HSLV  */
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_CS_GPIO_PORT, HSPI_CS_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_DQS0_GPIO_PORT, HSPI_DQS0_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_DQS1_GPIO_PORT, HSPI_DQS1_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_CLK_GPIO_PORT, HSPI_CLK_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_NCLK_GPIO_PORT, HSPI_NCLK_PIN);

  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D0_GPIO_PORT, HSPI_D0_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D1_GPIO_PORT, HSPI_D1_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D2_GPIO_PORT, HSPI_D2_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D3_GPIO_PORT, HSPI_D3_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D4_GPIO_PORT, HSPI_D4_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D5_GPIO_PORT, HSPI_D5_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D6_GPIO_PORT, HSPI_D6_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D7_GPIO_PORT, HSPI_D7_PIN);

  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D8_GPIO_PORT, HSPI_D8_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D9_GPIO_PORT, HSPI_D9_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D10_GPIO_PORT, HSPI_D10_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D11_GPIO_PORT, HSPI_D11_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D12_GPIO_PORT, HSPI_D12_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D13_GPIO_PORT, HSPI_D13_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D14_GPIO_PORT, HSPI_D14_PIN);
  // HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D15_GPIO_PORT, HSPI_D15_PIN);

  // /* Reset the HSPI memory interface */
  // HSPI_FORCE_RESET();
  // HSPI_RELEASE_RESET();

