sakumisu/sdk-bsp-stm32h7r-realthread-artpi2/libraries/bsp_components/hspi/stm32h7rsxx_hspi.c
  // HAL_NVIC_EnableIRQ(HSPI1_IRQn);
  // HAL_NVIC_EnableIRQ(HSPI_RAM_DMAx_IRQn);
}

/**
  * @brief  De-Initializes the HSPI MSP.
  * @param  hhspi HSPI handle
  * @retval None
  */
static void HSPI_RAM_MspDeInit(const XSPI_HandleTypeDef *hhspi)
{
  // static DMA_HandleTypeDef dma_handle;

  // /* hhspi unused argument(s) compilation warning */
  // UNUSED(hhspi);
  HAL_XSPI_DeInit((XSPI_HandleTypeDef *)hhspi);

  // /* Disable DMA and HSPI interrupts */
  // HAL_NVIC_DisableIRQ(HSPI_RAM_DMAx_IRQn);
  // HAL_NVIC_DisableIRQ(HSPI1_IRQn);

  // /* De-configure the HSPI DMA */
  // dma_handle.Instance = HSPI_RAM_DMAx_CHANNEL;
  // (void) HAL_DMA_DeInit(&dma_handle);

  // /* HSPI GPIO pins de-configuration  */
  // HAL_GPIO_DeInit(HSPI_CLK_GPIO_PORT, HSPI_CLK_PIN);
  // HAL_GPIO_DeInit(HSPI_NCLK_GPIO_PORT, HSPI_NCLK_PIN);
  // HAL_GPIO_DeInit(HSPI_DQS0_GPIO_PORT, HSPI_DQS0_PIN);
  // HAL_GPIO_DeInit(HSPI_DQS1_GPIO_PORT, HSPI_DQS1_PIN);
  // HAL_GPIO_DeInit(HSPI_CS_GPIO_PORT, HSPI_CS_PIN);
  // HAL_GPIO_DeInit(HSPI_D0_GPIO_PORT, HSPI_D0_PIN);
  // HAL_GPIO_DeInit(HSPI_D1_GPIO_PORT, HSPI_D1_PIN);
  // HAL_GPIO_DeInit(HSPI_D2_GPIO_PORT, HSPI_D2_PIN);
  // HAL_GPIO_DeInit(HSPI_D3_GPIO_PORT, HSPI_D3_PIN);
  // HAL_GPIO_DeInit(HSPI_D4_GPIO_PORT, HSPI_D4_PIN);
  // HAL_GPIO_DeInit(HSPI_D5_GPIO_PORT, HSPI_D5_PIN);
  // HAL_GPIO_DeInit(HSPI_D6_GPIO_PORT, HSPI_D6_PIN);
  // HAL_GPIO_DeInit(HSPI_D7_GPIO_PORT, HSPI_D7_PIN);
  // HAL_GPIO_DeInit(HSPI_D8_GPIO_PORT, HSPI_D8_PIN);
  // HAL_GPIO_DeInit(HSPI_D9_GPIO_PORT, HSPI_D9_PIN);
  // HAL_GPIO_DeInit(HSPI_D10_GPIO_PORT, HSPI_D10_PIN);
  // HAL_GPIO_DeInit(HSPI_D11_GPIO_PORT, HSPI_D11_PIN);
  // HAL_GPIO_DeInit(HSPI_D12_GPIO_PORT, HSPI_D12_PIN);
  // HAL_GPIO_DeInit(HSPI_D13_GPIO_PORT, HSPI_D13_PIN);
  // HAL_GPIO_DeInit(HSPI_D14_GPIO_PORT, HSPI_D14_PIN);
  // HAL_GPIO_DeInit(HSPI_D15_GPIO_PORT, HSPI_D15_PIN);

  // /* Reset the HSPI memory interface */
  // __HAL_RCC_XSPI1_FORCE_RESET();
  // __HAL_RCC_XSPI1_RELEASE_RESET();

  // /* Disable the HSPI memory interface clock */
  // HSPI_CLK_DISABLE();
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
